

#--Загрузка новых задач в БД----------------
#-------------------------------------------

#--Выгрузка задач на день из БД-------------
#-------------------------------------------

#--Удаление выполненных задач---------------
#-------------------------------------------

#--Запрос на обновление времени-------------
# (автоотложение задачи на расчит. кол. дней, и отложение на заданное время)
#-------------------------------------------

#--Запрос на имеющиеся продукты-------------
#-------------------------------------------

#--Запрос требуемых продуктов---------------
#-------------------------------------------

#--Запрос на актуализацию наличия продуктов-
# (ревизия по сроку годности)
#-------------------------------------------

#--Добавление дневных задач из общей БД-----
#-------------------------------------------

#--Изменение меню---------------------------
#-------------------------------------------

#--Добавление меню--------------------------
#-------------------------------------------

#--Добавление в экстренную таблицу----------???
#-------------------------------------------

#--Запрос в экстренную таблицу--------------???
# (передача в систему оповещений)
#-------------------------------------------

#--Удаление из экстренной таблицы-----------???
#-------------------------------------------